Keule/ZAI_GPS/ag-steer/steer-controller/src/hal_esp32/hal_impl.cpp
bool hal_imu_read(float* yaw_rate_dps, float* roll_deg) {
    if (!yaw_rate_dps || !roll_deg) return false;
    const uint32_t now_us = micros();
    if (!s_imu_cache_valid || (now_us - s_imu_last_poll_us) >= k_spi_cfg_imu.period_us) {
        spiCheckDeadline(&s_poll_imu, k_spi_cfg_imu.period_us, now_us);
        uint8_t tx[4] = {0x00, 0x00, 0x00, 0x00};
        uint8_t rx[4] = {0};
        spiTransfer(SpiClient::BNO085, tx, rx, sizeof(tx));
        s_imu_yaw_cache = 0.0f;   // TODO: decode SH-2 payload
        s_imu_roll_cache = 0.0f;  // TODO: decode SH-2 payload
        s_imu_last_poll_us = now_us;
        s_imu_cache_valid = true;
        s_poll_imu.transactions++;
    }
    *yaw_rate_dps = s_imu_yaw_cache;
    *roll_deg = s_imu_roll_cache;
    return true;
}

bool hal_imu_detect(void) {
    // BNO085 detection: read chip ID from register 0x00
    // Expected chip ID: 0x00 (BNO085 responds to SPI reset)
    // For now, verify SPI bus is responsive by attempting a transfer
    uint8_t tx = 0x00;
    uint8_t response = 0;
    spiTransfer(SpiClient::BNO085, &tx, &response, 1);

    // 0xFF = floating MISO (no device pulling it down)
    // 0x00 = MISO stuck LOW (bus fault)
    // A real BNO085 would respond with its chip ID.
    bool detected = (response != 0xFF && response != 0x00);
    hal_log("ESP32: IMU detect: SPI response=0x%02X %s",
            response, detected ? "OK" : "FAIL (no device)");
    return detected;
}

// ===================================================================
// ADS1118 - 16-Bit ADC for steering angle potentiometer
// ===================================================================
// Uses libdriver/ads1118 (lib/ads1118/src/) for initialisation only.
// For runtime reads, we bypass the libdriver and read raw ADC data
// directly via SPI to avoid the "range is invalid" bug in the
// libdriver's continuous_read() (which reads back the config register
// and fails if SPI returns garbage).
//
// The libdriver is used only for:
//   - ads1118_init() — verify interface functions
//   - ads1118_set_channel/range/rate/mode — configure the chip
//   - ads1118_start_continuous_read() — start continuous conversion
//
// All subsequent reads use ads1118_read_raw() which sends 0xFF×2
// and reads back 2 bytes as a raw int16_t ADC value. No config
// register read-back, no range validation.
//
// Wiring:
//   ADS1118 DOUT  -> GPIO 15 (MISO)
//   ADS1118 DIN   -> GPIO 17 (MOSI)
//   ADS1118 SCLK  -> GPIO 16 (SCK)
//   ADS1118 CS    -> GPIO 18
//
// Calibration:
//   Raw ADC min (left stop)  -> -22.5°
//   Raw ADC max (right stop) -> +22.5°
//   Stored in NVS (Preferences) and survives reboots.
// ===================================================================

/// libdriver ADS1118 handle (used for init/config only)
static ads1118_handle_t s_ads1118_handle;

/// ADS1118 detected flag
static bool s_ads1118_detected = false;

/// Calibration state
static bool   s_calibrated = false;
static int16_t s_cal_left_raw  = 0;   // ADC value at left stop  -> -22.5°
static int16_t s_cal_right_raw = 0;   // ADC value at right stop -> +22.5°

/// NVS namespace and keys for calibration persistence
static const char* NVS_NAMESPACE = "agsteer";
static const char* NVS_KEY_CAL_VALID  = "cal_v";
static const char* NVS_KEY_CAL_LEFT   = "cal_l";
static const char* NVS_KEY_CAL_RIGHT  = "cal_r";
static constexpr uint32_t NVS_CAL_MAGIC = 0xA6511C00;  // magic to validate stored data

// --- libdriver interface functions (static, ESP32-specific) ---

static uint8_t ads1118_if_spi_init(void) {
    pinMode(CS_STEER_ANG, OUTPUT);
    digitalWrite(CS_STEER_ANG, HIGH);
    return 0;
}

static uint8_t ads1118_if_spi_deinit(void) {
    return 0;  // Don't deinit shared bus
}

static uint8_t ads1118_if_spi_transmit(uint8_t *tx, uint8_t *rx, uint16_t len) {
    spiTransfer(SpiClient::ADS1118, tx, rx, len);
    return 0;
}

static void ads1118_if_delay_ms(uint32_t ms) {
    delay(ms);
}

static void ads1118_if_debug_print(const char *const fmt, ...) {
    va_list args;
    va_start(args, fmt);
    char buf[256];
    std::vsnprintf(buf, sizeof(buf), fmt, args);
    va_end(args);
    Serial.print(buf);
}

// --- Direct raw ADC read (bypasses libdriver) ---

/// Read one raw 16-bit ADC sample directly via SPI.
/// Sends 0xFF×2, receives 2 bytes as big-endian int16_t.
/// This avoids the libdriver's config register read-back which can
/// trigger "range is invalid" if SPI returns garbage.
static int16_t ads1118_read_raw(void) {
    const uint32_t now_us = micros();
    if (s_was_cache_valid && (now_us - s_was_last_poll_us) < k_spi_cfg_ads.period_us) {
        return s_was_raw_cache;
    }
    spiCheckDeadline(&s_poll_was, k_spi_cfg_ads.period_us, now_us);
    uint8_t tx[2] = {0xFF, 0xFF};
    uint8_t rx[2] = {0};
    ads1118_if_spi_transmit(tx, rx, 2);
    s_was_raw_cache = static_cast<int16_t>((static_cast<uint16_t>(rx[0]) << 8) | rx[1]);
    s_was_last_poll_us = now_us;
    s_was_cache_valid = true;
    s_poll_was.transactions++;
    return s_was_raw_cache;
}

/// Read multiple raw samples and return the median value.
/// More robust than average against outliers.
/// @param samples  number of samples to read (should be odd for true median)
/// @param delay_ms delay between samples in ms (default: 5ms for 250 SPS)
static int16_t ads1118_read_raw_median(int samples, int sample_delay_ms = 5) {
    // Buffer for samples (max 31, enough for median)
    int16_t buf[31];
    if (samples > 31) samples = 31;
    if (samples < 1) samples = 1;

    for (int i = 0; i < samples; i++) {
        buf[i] = ads1118_read_raw();
        if (sample_delay_ms > 0) delay(sample_delay_ms);
    }

    // Simple bubble sort for small array
    for (int i = 0; i < samples - 1; i++) {
        for (int j = i + 1; j < samples; j++) {
            if (buf[j] < buf[i]) {
                int16_t tmp = buf[i];
                buf[i] = buf[j];
                buf[j] = tmp;
            }
        }
    }

    return buf[samples / 2];  // median
}

// --- Calibration persistence (NVS) ---

